info = {
  'enduring?1':'Увеличивает максимальную энергию на 0.',
  'enduring?2':'Увеличивает максимальную энергию на 1.',
  'enduring?3':'Увеличивает максимальную энергию на 2.',
  
  'resistant?1':'Увеличивает лимит урона для потери жизней на 1.',
  'resistant?2':'Увеличивает лимит урона для потери жизней на 2.',
  'resistant?3':'Увеличивает лимит урона для потери жизней на 4.',
  
  'dvuzhil?1':'Увеличивает максимум жизней и сопротивление кровотечению на 1.',
  'dvuzhil?2':'Увеличивает максимум жизней и сопротивление кровотечению на 2.',
  'dvuzhil?3':'Увеличивает максимум жизней и сопротивление кровотечению на 3.',
  
  'zapas?1':'В начале боя вы получаете 1 случайный дополнительный предмет.',
  'zapas?2':'В начале боя вы получаете 2 случайных дополнительных предмета.',
  'zapas?3':'В начале боя вы получаете 3 случайных дополнительных предмета.',
  
  'armor?1':'Вы получаете 10% шанс заблокировать 1 урона каждый ход.',
  'armor?2':'Вы получаете 15% шанс заблокировать 1 урона каждый ход.',
  'armor?3':'Вы получаете 20% шанс заблокировать 2 урона каждый ход.',
  
  #'pricel?1':'Вы теряете 2 точности, но получаете +1 к урону. Работает только для оружия дальнего боя.',
  #'pricel?2':'Вы теряете 1 точности, но получаете +1 к урону. Работает только для оружия дальнего боя.',
  #'pricel?3':'Вы теряете 1 точности, но получаете +2 к урону. Работает только для оружия дальнего боя.',
  
  'shieldgen?1':'Каждые 7 ходов вы получаете щит. Перезарядка не идет, если не был потрачен щит с предыдущей генерации.',
  'shieldgen?2':'Каждые 5 ходов вы получаете щит. Перезарядка не идет, если не был потрачен щит с предыдущей генерации.',
  'shieldgen?3':'Каждые 3 хода вы получаете щит. Перезарядка не идет, если не был потрачен щит с предыдущей генерации.',
  
  'medic?1':'В начале боя вы получаете стимулятор, который восстанавливает 1 хп при использовании.',
  'medic?2':'В начале боя вы получаете стимулятор, который восстанавливает 2 хп при использовании.',
  'medic?3':'В начале боя вы получаете стимулятор, который восстанавливает 3 хп при использовании.',
  
  'zombie?1':'Перед тем, как умереть, вы проживете 1 дополнительный ход.',
  'zombie?2':'Перед тем, как умереть, вы проживете 2 дополнительных хода.',
  'zombie?3':'Перед тем, как умереть, вы проживете 3 дополнительных хода.',
  
  'bicepc?1':'Если у вас оружие ближнего боя, вы получаете 15% шанс нанести удвоенный урон при атаке.',
  'bicepc?2':'Если у вас оружие ближнего боя, вы получаете 25% шанс нанести удвоенный урон при атаке.',
  'bicepc?3':'Если у вас оружие ближнего боя, вы получаете 40% шанс нанести удвоенный урон при атаке.',
  
  'sadist?1':'Отнимая ХП противнику, вы восстанавливаете 1 энергию.',
  'sadist?2':'Отнимая ХП противнику, вы восстанавливаете 1 энергию и получаете +(0-1) урона на следующий ход.',
  'sadist?3':'Отнимая ХП противнику, вы восстанавливаете 1 энергию и получаете +(0-2) урона на следующий ход.',

  'berserk?1':'Когда у вас остается ровно 1 хп, вы получаете +1 урона. Ваша изначальная энергия уменьшается пропорционально вашим максимальным хп, но вы получаете '+\
              '+1 максимальной и текущей энергии за каждую потерянную жизнь.',
  'berserk?2':'Когда у вас остается ровно 1 хп, вы получаете +2 урона. Ваша изначальная энергия уменьшается пропорционально вашим максимальным хп, но вы получаете '+\
              '+1 максимальной и текущей энергии за каждую потерянную жизнь.',
  'berserk?3':'Когда у вас остается ровно 1 хп, вы получаете +3 урона. Ваша изначальная энергия уменьшается пропорционально вашим максимальным хп, но вы получаете '+\
              '+1 максимальной и текущей энергии за каждую потерянную жизнь.',

  'protivogaz?1':'Горение длится на вас один ход вместо двух.',
  'protivogaz?2':'Горение длится на вас один ход вместо двух. Вы получаете иммунитет к световым гранатам.',
  'protivogaz?3':'Горение длится на вас один ход вместо двух. Вы получаете иммунитет к световым гранатам и +1 максимальной энергии.',

  'narkoman?1':'Вы теряете 2 точности. Используя на себя джет, хитин или адреналин, вы получаете +2 к точности и +1 к урону на один ход.',
  'narkoman?2':'Вы теряете 1 точности. Используя на себя джет, хитин или адреналин, вы получаете +2 к точности и +1 к урону на один ход. В начале боя вы получаете один из этих предметов.',
  'narkoman?3':'Вы теряете 1 точности. Используя на себя джет, хитин или адреналин, вы получаете +2 к точности и +2 к урону на один ход. В начале боя вы получаете один из этих предметов.',

  'vor?1':'Раз в 3 хода вы можете украсть у цели предмет, который та собиралась использовать.',
  'vor?2':'Раз в 3 хода вы можете украсть у цели предмет, который та собиралась использовать. Если вы используете дальнее оружие, вы пассивно получаете +1 к точности.',
  'vor?3':'Раз в 3 хода вы можете украсть у цели предмет, который та собиралась использовать. Если вы используете дальнее оружие, вы пассивно получаете +1 к точности.'+\
          'Каждый ход вы имеете 20% шанс пассивно использовать эту способность на случайной цели.',

  'incvizitor?1':'Раз в 6 ходов вы можете направить гнев небес на соперника. Если в этот ход соперник делает действие, наносящее вред, то через 2 хода он будет оглушен. '+\
                 'Если применить на союзника, то в этот ход он не может умереть. Один раз за игру вы имеете 10% шанс не умереть, когда хп опустится до 0, '+\
                 'даже если не использовали способность.',
  'incvizitor?2':'Раз в 5 ходов вы можете направить гнев небес на соперника. Если в этот ход соперник делает действие, наносящее вред, то через 2 хода он будет оглушен. '+\
                 'Если применить на союзника, то в этот ход он не может умереть. Один раз за игру вы имеете 25% шанс не умереть, когда хп опустится до 0, '+\
                 'даже если не использовали способность.',
  'incvizitor?3':'Раз в 4 хода вы можете направить гнев небес на соперника. Если в этот ход соперник делает действие, наносящее вред, то через 2 хода он будет оглушен. '+\
                 'Если применить на союзника, то в этот ход он не может умереть. Один раз за игру вы имеете 40% шанс не умереть, когда хп опустится до 0, '+\
                 'даже если не использовали способность.',

  'pyrotech?1':'В начале игры вы получаете бомбу, которая наносит 1 урона. Можно потратить ход, чтобы улучшить её на +1 урона, число улучшений не ограничено.',
  'pyrotech?2':'В начале игры вы получаете бомбу, которая наносит 1 урона. Можно потратить ход, чтобы улучшить её на +2 урона, число улучшений не ограничено.',
  'pyrotech?3':'В начале игры вы получаете бомбу, которая наносит 1 урона. Можно потратить ход, чтобы улучшить её на +3 урона, число улучшений не ограничено.',

  'cherep?1':'Вы получаете 20% шанс заблокировать 1 урона каждый ход. Лимит урона для потери жизней увеличивается на 1.',
  'cherep?2':'Вы получаете 30% шанс заблокировать 1 урона каждый ход. Лимит урона для потери жизней увеличивается на 3.',
  'cherep?3':'Вы получаете 40% шанс заблокировать 1-2 урона каждый ход. Лимит урона для потери жизней увеличивается на 5.',

  'alchemist?1':'В начале игры и каждые 10 ходов вы получаете сыворотку бешенства, которая заставляет выбранную цель атаковать дополнительно к своему действию.',
  'alchemist?2':'В начале игры и каждые 8 ходов вы получаете сыворотку бешенства, которая заставляет выбранную цель атаковать дополнительно к своему действию.',
  'alchemist?3':'В начале игры и каждые 6 ходов вы получаете сыворотку бешенства, которая заставляет выбранную цель дважды атаковать дополнительно к своему действию.',

  'ninja?1':'По вашему перекату невозможно попасть атакой.',
  'ninja?2':'По вашему перекату невозможно попасть атакой. Уменьшает перезарядку переката на 1 ход.',
  'ninja?3':'По вашему перекату невозможно попасть атакой. Уменьшает перезарядку переката на 1 ход. Шанс попасть по вам пассивно уменьшается на 1.',

  'inzhener?1':'Раз в 6 ходов вы можете создать предмет, выбрав один из двух.',
  'inzhener?2':'Раз в 5 ходов вы можете создать предмет, выбрав один из трех. За каждое использование урон обычной гранаты увеличивается на 1.',
  'inzhener?3':'Раз в 4 хода вы можете создать предмет, выбрав один из трех. За каждое использование урон обычной гранаты увеличивается на 2.',

  'greedy?1':'Во время выполнения квестов у вас есть шанс найти 👝мешок золота.',
  'greedy?2':'Во время выполнения квестов у вас есть еще больший шанс найти 👝мешок золота.',
  'greedy?3':'Во время выполнения квестов у вас есть ЕЩЕ БОЛЬШИЙ шанс найти 👝мешок золота.',

  'goodsleep?1':'Во время отдыха вы восстанавливаете одну стамину не за час, а за 55 минут. Можно снять только спустя 6 часов после экипировки.',
  'goodsleep?2':'Во время отдыха вы восстанавливаете одну стамину не за час, а за 50 минут. Можно снять только спустя 6 часов после экипировки.',
  'goodsleep?3':'Во время отдыха вы восстанавливаете одну стамину не за час, а за 45 минут. Можно снять только спустя 6 часов после экипировки.',

}

